[
  {
    "title": "Full Stack Developer",
    "company": "Disgrafic",
    "period": "2011 - Actualidad",
    "description": "Especializacion en desarrollo web y aplicaciones online, usando DotNetNuke como CMS o simplemente aplicaciones web basadas en React + Node.js o MVC NET.",
    "highlights": [
      "Responsable de la planificación, desarrollo y entrega de proyectos web asignados, desde la definición técnica hasta la puesta en producción.",
      "Diseño de la arquitectura, elección de tecnologías y toma de decisiones clave en cada proyecto, en coordinación directa con la dirección.",
      "Creación y optimización de bases de datos adaptadas a las necesidades de cada cliente y proyecto.",
      "Uso de Azure DevOps para el control de versiones, seguimiento de tareas y despliegue continuo.",
      " Participación en reuniones iniciales para la recogida de requisitos y establecimiento de plazos, asegurando la alineación con los objetivos de la empresa.",
      "Implementación de soluciones tanto en frontend (React) como en backend (Node.js, .NET MVC), integrando tecnologías modernas y buenas prácticas.",
      "Organización y distribución del trabajo de forma autónoma para cumplir con los plazos acordados con la empresa."
      
    ],
    "tags": ["React", "Node.js", "MongoDB", "AWS", "Docker", "Kubernetes"]
  },
  {
    "title": "PSDtoDNN",
    "company": "PsDtoDNN",
    "period": "2011 - 2018",
    "description": "Llebe a cabo un site de conversion de diseños a implementacion de themes en HTML/CSS y javascript a partir de documentos de photoshop PSD.",
    "highlights": [
      "Diseños medios y avanzados optimizados para la plataforma DNN",
      "Reduje el tiempo de desarrollo en un 40% implementando SCSS y sistema mixto de Bootstrap CSS y Framework propio."
    ],
    "tags": ["React", "Node.js", "MongoDB", "AWS", "Docker", "Kubernetes"]
  },
  {
    "title": "Consultant Junior",
    "company": "Pasiona",
    "period": "2007 - 2008",
    "description": "Trabajando en un proyecto en el Banc Sabadell.",
    "highlights": [
      "Ayude en el desarrollo de una aplicación en C#, orientada a los directivos del banc Sabadell",
      "Hice verificaciones, tests y pequeños desarrollos.",
      "Optimicé queries de base de datos reduciendo el tiempo de carga en un 70%"
    ],
    "tags": ["Vue.js", "Express", "PostgreSQL", "Redis", "Stripe API"]
  },
  {
    "title": "Grado en Ingeniería Informática",
    "company": "EU Informatica Tomàs Cerdà",
    "period": "2005 - 2008",
    "description": "Especialización en Ingeniería del Software y Sistemas de Información.",
    "highlights": [
      
    ],
    "tags": ["Java", "Python", "C++", "SQL", "Machine Learning"]
  }
] 